{
  "schema_version": 1,
  "id": "pcrc",
  "authors": [
    "Fallen_Breath"
  ],
  "repository": "https://github.com/Fallen-Breath/PCRC",
  "branch": "master",
  "related_path": ".",
  "labels": [
    "tool"
  ],
  "introduction": {
    "en_us": "PCRC\n--------\n\n**English** | [中文](https://github.com/Fallen-Breath/PCRC/tree/master/readme_cn.md)\n\n> PyCraft based Replay Client\n\nA Minecraft client that can record a replay file (*.mcpr) which can be recognized by [Replay Mod](https://www.replaymod.com/)\n\nGreat thanks to [SARC](https://github.com/Robitobi01/SARC) for the replay logic stuffs and [pyCraft](https://github.com/ammaraskar/pyCraft) for the minecraft client stuffs\n\n## Environment\n\nPython version should be python3 and at least it works on Python 3.6 and Python 3.8\n\n### Python modules\n\n- cryptography\n- requests\n- pynbt\n- redbaron\n- colorlog\n- ruamel.yaml\n\nThe requirements are also stored in `requirements.txt`\n\n### Minecraft server\n\nPCRC currently supports connecting to vanilla Minecraft server. Supported versions:\n\n- 1.12 / 1.12.2\n- 1.14.4\n- 1.15.2\n- 1.16.1 ~ 1.16.5\n- 1.17.1\n- 1.18 ~ 1.18.2\n\n## Advantage\n\n- Can be hosted server side for 24/7 recording\n- Has way less performance usage than a regular Minecraft client\n- It can be set to record only when the player is nearby\n- Multiple options can be set for custom recording\n- Restart after raw file size reaches 2048MB or recording time reaches 5 hours to prevent oversize recording\n- Since the virtual player (bot) doesn't move, the recording file will not include unnecessary packets related to chunk loading, which can significantly reduce recording file size\n\n## Usage\n\n### Direct Launch\n\n1. Download and unzip the latest PCRC in [Release](https://github.com/Fallen-Breath/PCRC/releases) page\n2. Run `python PCRC.pyz` or `PCRC.exe`\n- On first start, PCRC will generate default config file and exit. Fill in the config file on demand before launch it again\n3. Input `start` in the console to start PCRC\n4. (**Recommand**) Set the gamemode of the PCRC bot to spectator\n5. Use console or chat in game to control PCRC\n\n### As a MCDR plugin\n\nRequires [MCDReforged](https://github.com/Fallen-Breath/MCDReforged) >= 2.0\n\nPut the `PCRC.pyz` downloaded from [Release](https://github.com/Fallen-Breath/PCRC/releases) into the plugin folder of MCDR and that's it\n\nNOTE: Unloading the plugin will cause PCRC to stop recording and exit the game\n\n## Config\n\nThe config file is `config.json`. All settings can be changed in it. Those which are similar to ABC inside it are just comments, don't need to modify them\n\nWhen used as a plugin for MCDR, the path to the configuration file will be `config/pcrc/config.json`, and `config/pcrc/mcdr_config.json` store the configuration related to MCDR\n\n### Base\n\n`language`: The language that the PCRC bot will speak in the game. Language file should be in folder `lang/`\n\n`recording_temp_file_directory`: Path to the directory where PCRC will store its temporary recording files in\n\n`recording_storage_directory`: Path to the directory where PCRC will save its finished recording files\n\n`debug_mode`: Whether outputs debug info or not\n\n### Account and Server\n\n`authenticate_type`: The way for PCRC to login your account. It can be `offline`, `mojang` or `microsoft`, respectively corresponding to offline account, Mojang account login and Microsoft account login\n\nIf you use Microsoft account login, when you connect to the server for the first time after startup, you need to log in with your Microsoft account according to the console output\n\n`username`: The username for offline mode login, or the email address of the Minecraft account if you are using `mojang` type online mode login\n\n`password`: The password of the Minecraft account if you are using `mojang` type online mode login\n\n`store_token`: When set to true and the `authenticate_type` is `microsoft`, the microsoft login token will be saved to file `token.json`. When launching PCRC the stored token will be loaded and used if it's not expired. Noted: The login token will be stored in plaintext\n\nExamples for those account related config entries:\n\n```json5\n// Log in with offline mode\n{\n    \"authenticate_type\": \"offline\",\n    \"username\": \"MyPlayerName\",  // the player name you want to use\n    \"password\": \"\",  // This entry will not be used and will be ignored\n}\n```\n\n```json5\n// Log in with mojang account\n{\n    \"authenticate_type\": \"mojang\",\n    \"username\": \"MyEmail@mail.com\",  // your mojang account email address\n    \"password\": \"mypassword\",  // your mojang account password\n}\n```\n\n```json5\n// Log in with microsoft account\n{\n    \"authenticate_type\": \"microsoft\",\n    \"username\": \"\",  // This entry will not be used and will be ignored\n    \"password\": \"\",  // This entry will not be used and will be ignored\n}\n```\n\n`address`: IP Address of the Minecraft server\n\n`port`: Port of the Minecraft server\n\n`server_name`: The server name showed in replay viewer\n\n`initial_version`: The preferred Minecraft version that used to connect to bungeecord like server\n\n### PCRC Control\n\n`file_size_limit_mb`: The limit of size of the `.tmcpr` file. Every time it is reached, PCRC will restart. Default: `2048`\n\n`file_buffer_size_mb`: The limit of size of file buffer. Every time it is reached, PCRC will flush all content in the buffer into `.tmcpr` file. Default: `8`\n\n`time_recorded_limit_hour`: The limit of actual recording time. Every time it is reached, PCRC will restart. Default: `12`\n\n`delay_before_afk_second`: The time delay between every player leaving and PCRC pausing recording. Default: `15`\n\n`afk_ignore_spectator`: If set to true, PCRC will ignore all packets from spectator players when determining if it should pause recording due to all players have left. Default: `true`\n\n`record_packets_when_afk`: If set to false, PCRC will ignore almost every incoming packets when PCRC pauses recording (SARC's behavior). This can decrease the replay file size a lot but might cause block / entity desync if there will be something happening after player leaves. Default: `true`\n\n`auto_relogin`: If this option is enabled, and the client gets disconnected, PCRC will automatically try to reconnect\n\n`auto_relogin_attempts`: The maximum amount of relogin attempts before login success . Default: `5`\n\n`chat_spam_protect`: Automatically delay between sending chat messages if necessary to prevent being kicked for spamming\n\n`command_prefix`: Any chat message starts with `command_prefix` will be recognize as a command to control PCRC. Default: `!!PCRC`\n\n### PCRC Features\n\n`daytime`: Sets the daytime once to the defined time in the recording and ignores all further changes from the server. If set to `-1` the normal day/night cycle is recorded\n\n`weather`: Turns weather in the recording on or off\n\n`with_player_only`: If set to true, PCRC only record packets if there are players nearby\n\n`remove_items`: If set to true, all dropped items wont be recorded\n\n`remove_bats`: If set to true, bats won't be recorded\n\n`remove_phantoms`: If set to true, phantoms won't be recorded\n\n`on_joined_commands`: A string list storing the commands that the PCRC bot will enter in sequence after it joins the game. You might need this if the server has some kind of login plugin etc.\n\n```json5\n// on_joined_commands example\n{\n    \"on_joined_commands\": [\n        \"/login myPassword\",\n        \"/server myServer\"\n    ],\n}\n```\n\n### PCRC Whitelist\n\n`enabled`: Whether to enable whitelist\n\n`whitelist`: Whitelist player list\n\n## Command\n\nCommand prefix `!!PCRC` can be customized in the config file\n\n### Console Command\n\nAvailable if launched directly\n\n`help`: Show the list of console command\n\n`start`: Start PCRC and start recording\n\n`stop`: Stop PCRC and stop recording\n\n`restart`: Restart PCRC\n\n`exit`: Exit the program\n\n`reload`: Reload the config file. Notes that not all config entries support hot-reload, e.g. `authenticate_type` is not hot-reload-able\n\n`auth`: Authenticate with minecraft again. Used when the previous authentication failed\n\n`say <text>`: Send text `<text>` to the server as a chat message\n\n`set <option> <value>` Set option to value of PCRC and in the config file\n\n`whitelist [on|off]` Switch the whitelist switch\n\n`whitelist [add|del] <player>` Add or delete a player to(from) the whitelist\n\n`whitelist status` To view the status of the whitelist and the whitelisted player(s)\n\n`status`: Show the status of PCRC\n\n`list`: Show the player list in the server if connected\n\n### MCDR Plugin command\n\nAvailable if used as a MCDR plugin\n\n`!!PCRC start`: start PCRC and start recording\n\n`!!PCRC stop`: stop PCRC and stop recording. Only works with console command input\n\n`!!PCRC reload`: Reload the config for PCRC and the config file for MCDR. Notes that not all PCRC config entries support hot-reload\n\n`!!PCRC set_redirect_url <url>`: Input the url used in microsoft logging in\n\nRequires permission level 1 to use these commands. The minimum required permission level can be set in the config file for MCDR\n\n### In Game Command\n\nUsing normal in game chatting to trigger\n\n`!!PCRC`: show help\n\n`!!PCRC status`: show status\n\n`!!PCRC here`: emit a \"!!here\" command\n\n`!!PCRC pos`: show position, might not be 100% accurate\n\n`!!PCRC spec`: use the teleport ability in spectator mode to teleport to the player who sent this command\n\n`!!PCRC stop`: stop PCRC\n\n`!!PCRC restart`: restart PCRC\n\n`!!PCRC set`: print all settable option\n\n`!!PCRC set <option> <value>`: set the value of `<option>` to `<value>` which won't write to config file\n\n`!!PCRC name <filename>`: set recording file name to `<filename>`\n\n`!!PCRC respawn`: let PCRC bot try to respawn\n\n## Notes\n\n- There's not any code for processing game content in PCRC so if you want to move the PCRC bot you can only use teleport command like `!!PCRC spec` or `/tp`. You can not use stuffs like piston to move the bot otherwise some wired behaviors like the bot become invisible may occur\n- The file size that PCRC shows when recording is the size of `.tmcpr` file, the uncompressed raw packet file size. It's not the size of the final recording file `.mcpr`. The final file size is about 10% to 40% of the original packet file size, depending on the situation\n"
  },
  "introduction_urls": {
    "en_us": "https://raw.githubusercontent.com/Fallen-Breath/PCRC/master/readme.md"
  }
}