{
  "url": "https://github.com/TISUnion/PrimeBackup",
  "name": "PrimeBackup",
  "full_name": "TISUnion/PrimeBackup",
  "html_url": "https://github.com/TISUnion/PrimeBackup",
  "description": "A powerful backup plugin for MCDR, an advanced backup solution for your Minecraft world",
  "archived": false,
  "stargazers_count": 86,
  "watchers_count": 86,
  "forks_count": 9,
  "readme": "# Prime Backup\n\n**English** | [中文](https://github.com/TISUnion/PrimeBackup/tree/master/README.zh.md)\n\nA powerful backup plugin for MCDR, an advanced backup solution for your Minecraft world\n\nDocument: https://tisunion.github.io/PrimeBackup/\n\n## Features\n\n- Only stores files with changes with the hash-based file pool. Supports unlimited number of backup\n- Comprehensive backup operations, including backup/restore, list/delete, import/export, etc\n- Smooth in-game interaction, with most operations achievable through mouse clicks\n- Highly customizable backup pruning strategies, similar to the strategy use by [PBS](https://pbs.proxmox.com/docs/prune-simulator/)\n- Crontab jobs, including automatic backup, automatic pruning, etc.\n- Supports use as a command-line tool. Manage the backups without MCDR\n\n![!!pb command](https://raw.githubusercontent.com/TISUnion/PrimeBackup/master/docs/img/pb_welcome.png)\n\n## Requirements\n\n[MCDReforged](https://github.com/Fallen-Breath/MCDReforged) requirement: `>=2.12.0`\n\nPython package requirements: See [requirements.txt](https://github.com/TISUnion/PrimeBackup/tree/master/requirements.txt)\n\n## Usages\n\nSee the document: https://tisunion.github.io/PrimeBackup/\n\n## How it works\n\nPrime Backup maintains a custom file pool to store the backup files. Every file in the pool is identified with the hash value of its content.\nWith that, Prime Backup can deduplicate files with same content, and only stores 1 copy of them, greatly reduces the burden on disk usage.\n\nBesides that, Prime Backup also supports compression on the stored files, which reduces the disk usage further more\n\nPrimeBackup is capable of storing various of common file types, including regular files, directories, and symbolic links. For these 3 types:\n\n- Regular file: Prime Backup calculates its hash values first. If the hash does not exist in the file pool, \n  Prime backup will (compress and) store its content into a new blob in the file pool.\n  The file status, including mode, uid, mtime etc., will be stored in the database\n- Directory: Prime Backup will store its information in the database\n- Symlink: Prime Backup will store the symlink itself, instead of the linked target\n\n## Thanks\n\nThe idea for the hash-based file pool is inspired by https://github.com/z0z0r4/better_backup\n",
  "readme_url": "https://raw.githubusercontent.com/TISUnion/PrimeBackup/master/README.md"
}